In [73]:
import pandas as pd

In [74]:
df = pd.read_csv('data/new-site.csv')
df

    site\tdwell-time
0               0\t2
1              1\t48
2              0\t15
3              1\t16
4              0\t38
..               ...
295            0\t22
296             0\t7
297           1\t144
298            0\t89
299           0\t138

[300 rows x 1 columns]

In [75]:
def get_group(value):
    return value[0]

In [76]:
df['group'] = df['site\tdwell-time'].apply(get_group)

In [77]:
df

    site\tdwell-time group
0               0\t2     0
1              1\t48     1
2              0\t15     0
3              1\t16     1
4              0\t38     0
..               ...   ...
295            0\t22     0
296             0\t7     0
297           1\t144     1
298            0\t89     0
299           0\t138     0

[300 rows x 2 columns]

In [78]:
def to_time(val):
    return val[2:]

In [79]:
df['time'] = df['site\tdwell-time'].apply(to_time)

In [80]:
df.drop('site\tdwell-time', axis=1, inplace=True)

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   group   300 non-null    object
 1   time    300 non-null    object
dtypes: object(2)
memory usage: 4.8+ KB

In [82]:
df.head()

  group time
0     0    2
1     1   48
2     0   15
3     1   16
4     0   38

In [85]:
df['time'] = df['time'].astype(int)

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   group   300 non-null    object
 1   time    300 non-null    int32
dtypes: int32(1), object(1)
memory usage: 3.6+ KB

In [87]:
df.groupby('group')['time'].sum()

group
0    16898
1    10032
Name: time, dtype: int32